Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: This means that when you push to the server via SSH, Git will run this command to update the files needed for HTTP fetching.
es: Lo que significa que cada vez que envias (push) algo al servidor vía SSH, Git lanzará este comando y actualizará así los archivos necesarios para HTTP fetching. (_i_pendientedetraducir)

source: ## Transfer Protocols ##
es: ## Protocolos de transferencia ##

source: Now, the 'git' user can only use the SSH connection to push and pull Git repositories and can’t shell onto the machine.
es: De esta forma dejamos al usuario 'git' limitado a utilizar la conexión SSH solamente para enviar (push) y recibir (pull) repositorios, sin posibilidad de iniciar una sesión normal en el servidor.

source: You can make your first push to the new `iphone_project` project by adding your server as a remote to your local version of the project and pushing.
es: Puedes crear tu nuevo proyecto 'iphone_project' simplemente añadiendo tu servidor como un remoto a tu versión local del proyecto de control y enviando (push).

source: If you set this attribute on a file or set of files, then the next time you check out that branch, Git will replace that field with the SHA-1 of the blob.
es: Si colocas este attributo en un archivo o conjunto de archivos, Git lo sustituirá por la suma de comprobación SHA-1 la próxima vez que lo/s extraiga/s.

source: However, if someone uploaded a patch file generated via `format-patch` to a ticketing system or something similar, you can save the file locally and then pass that file saved on your disk to `git am` to apply it:
es: Sin embargo, si alguien sube su archivo de parche a un sistema de gestión de peticiones de servicio o similar; tendrás que descargartelo a un archivo local en tu disco y luego indicar ese archivo local al comando 'git am':

source: Git also gives you your own `master` branch starting at the same place as origin’s `master` branch, so you have something to work from (see Figure 3-22).
es: Git te proporcionará también tu propia rama 'master', apuntando al mismo lugar que la rama 'master' de 'origin'; siendo en esta última donde podrás trabajar.

source: Initial commit history with featureB work.
es: Historial inicial con el trabajo de la funcionalidad B.

source: First, let’s say you’re working on your project and have a couple of commits already (see Figure 3-10).
es: Imagina que estas trabajando en un proyecto, y tienes un par de confirmaciones (commit) ya realizadas. (ver Figura 3-10)

source: Git directory objects with branch head references included.
es: Objetos en la carpeta Git, con referencias a las cabeceras de las ramas.

source: This is a variant of a multiple-repository workflow.
es: Es una variante del flujo de trabajo con multiples repositorios.

source: The Git project provides a document that lays out a number of good tips for creating commits from which to submit patches — you can read it in the Git source code in the `Documentation/SubmittingPatches` file.
es: El propio proyecto Git suministra un documento con un gran número de buenas sugerencias sobre la creación de confirmaciones de cambio destinadas a enviar parches --puedes leerlo en el código fuente de Git, en el archivo 'Documentation/SubmittingPatches'--.

source: You may think to run this:
es: Puedes pensar en lanzar esto:

source: #!/usr/bin/env ruby
es: #!/usr/bin/env ruby#!/usr/bin/env ruby#!/usr/bin/env ruby

source: To see all the branches that contain work you haven’t yet merged in, you can run `git branch --no-merged`:
es: Para mostrar todas las ramas que contienen trabajos sin fusionar aún, puedes utilizar el comando 'git branch --no-merged':

source: To fix this, you must run `git submodule update` again:
es: Para arreglarlo, es necesario lanzar de nuevo el comando `git submodule update`:

source: Now that you can (I hope) determine which workflow combination may work for you, I’ll cover some more specific examples of how to accomplish the main roles that make up the different flows.
es: Espero que a estas alturas estés en condiciones de reconocer la combinación de flujos de trabajo que puede serte util. Vamos a ver algunos ejemplos más específicos, ilustrativos de los roles principales que se presentan en las distintas maneras de trabajar.

source: Generally, this happens because you force-delete a branch that had work on it, and it turns out you wanted the branch after all; or you hard-reset a branch, thus abandoning commits that you wanted something from.
es: Normalmente, esto suele suceder porque has forzado el borrado de una rama con trabajos no confirmados en ella, y luego te has dado cuenta de que realmente necesitabas dicha rama; o porque has reculado (hard-reset) una rama, abandonando todas sus confirmaciones de cambio, y luego te has dado cuenta que necesitabas alguna de ellas.

source: check_directory_perms
es: check_directory_permscheck_directory_perms

source: Suppose you want to add a mechanism that uses an access control list (ACL) that specifies which users are allowed to push changes to which parts of your projects.
es: Imaginemos que deseas implementar un sistema de control de accesos (Access Control List, ACL). Para vigilar qué usuarios pueden enviar (push) cambios a qué partes de tus proyectos.

source: Now you can add them all to your 'mobile' team so they have read and write access to `iphone_project`:
es: Y para añadirlos al equipo 'mobile', dándoles permisos de lectura y escritura sobre el proyecto 'phone_project':

source: This section splits them into committing-workflow hooks, e-mail–workflow scripts, and the rest of the client-side scripts.
es: En esta sección los dividiremos en puntos de enganche en el flujo de trabajo de confirmación de cambios, puntos en el flujo de trabajo de correo electrónico y resto de puntos de enganche del lado servidor.

source: Revert back to your production branch.
es: Vuelves a la rama de producción original.

source: This means that there is generally no pushing over this protocol.
es: Lo cual significa que, normalmente, no se podrá enviar (push) a través de este protocolo.

source: Now, move the `master` branch back to the middle commit:
es: Después, al mover la rama `master` de vuelta a la confirmación de cambios intermedia:

source: If you run `git push --tags`, the `maintainer-pgp-pub` tag will be shared with everyone.
es: Si lanzas el comando 'git push --tags', la etiqueta 'maintainer-pgp-pub' será compartida por todos.

source: John’s history after pushing to the origin server.
es: El historial de John tras enviar al servidor origen.

source: Insert 18333fig0414.png Figure 4-14.
es: Insert 18333fig0414.png Figura 4-14.

source: Then, for each of those, you find which files are modified and make sure the user who’s pushing has access to all the paths being modified.
es: Luego, para cada una de ellas, localizas los archivos modificados y te aseguras de que el usuario que las envia tiene realmente acceso a todas las ubicaciones que pretende modificar.

source: Assuming this happens, how can you get your commits back?
es: Asumiendo que estas cosas pasan, ¿cómo podrías recuperar tus confirmaciones de cambio perdidas?

source: This book covers how to use Git with 30 or so verbs such as `checkout`, `branch`, `remote`, and so on.
es: Este libro habla acerca de como utilizar Git con más o menos 30 verbos, tales como 'checkout', 'branch', 'remote', etc.

source: Well, let’s do another commit:
es: Bueno.... lo veremos tras realizar otra confirmación de cambios:

source: You need to get rid of anything that has a pointer to those old commits before you repack:
es: Antes de reempaquetar, asegurate de acabar completamente con cualquier elemento que apunte a las viejas confirmaciones de cambios:

source: Conceptually, the data in your Git repository looks something like Figure 3-1.
es: Conceptualmente, el contenido del repositorio Git será algo parecido a la Figura 3-1

source: Does the project have a maintainer or integration manager who checks all the patches?
es: ¿Tiene un gestor de integraciones que comprueba todos los parches?.

source: A topic branch is a short-lived branch that you create and use for a single particular feature or related work.
es: Una rama puntual es aquella de corta duración que abres para un tema o para una funcionalidad muy concretos.

source: - Bullet points are okay, too
es: - Los puntos con bolo también están permitidos.

source: On the command line, you can pull down several branches like so:
es: Escribiendo algo asi como:

source: One of the most complicated aspects of setting up a Git server is user management.
es: Porque la gestión de usuarios es precisamente uno de los aspectos más complicados de preparar un servidor Git.

source: Because you already merged in `iss53` earlier, you see it in your list.
es: Aparece la rama 'iss53' porque ya ha sido fusionada.

source: Insert 18333fig0314.png Figure 3-14.
es: Insert 18333fig0314.png Figura 3-14.

source: #### Applying a Patch with am ####
es: #### Incorporando un parche con am ####

source: Amazing.
es: ¡Sorprendente!.

source: This server is at `git.team1.ourcompany.com`.
es: Un servidor en 'git.team1.ourcompany.com'.

source: Each developer has committed a few times and merged each other’s work successfully; see Figure 5-10.
es: Cada desarrollador ha confirmado algunos cambios y ambos han fusionado sus trabajos correctamente; ver Figura 5-10.

source: You can also continue this concept, having an integrate branch where all the work is merged together.
es: Puedes continuar ampliando este concepto, disponiendo de una rama 'integrate' donde ir fusionando todo el trabajo entre sí.

source: Insert 18333fig0512.png Figure 5-12.
es: Insert 18333fig0512.png Figura 5-12.

source: Integration-manager workflow.
es: Flujo de trabajo Gestor-de-Integración.

source: Now that you have the permissions sorted out, you need to determine what paths the commits being pushed have modified, so you can make sure the user who’s pushing has access to all of them.
es: Una vez tienes los permisos en orden, necesitas averiguar las ubicaciones modificadas por las confirmaciones de cambios enviadas; de tal forma que puedas asegurarte de que el usuario que las está enviando tiene realmente permiso para modificarlas.

source: If you have a QA team that pushes a series of branches, and you want to get the master branch and any of the QA team’s branches but nothing else, you can use a config section like this:
es: Si tienes un equipo QA que envia al servidor una serie de ramas. Y deseas recuperar la rama master y cualquiera otra de las ramas del equipo; pero no recuperar ninguna rama de otro equipo. Puedes utilizar una sección de configuración como esta:

source: If you don’t know what is breaking, and there have been dozens or hundreds of commits since the last state where you know the code worked, you’ll likely turn to `git bisect` for help.
es: Pero no siendo ese el caso, y habiendose realizado docenas o cientos de confirmaciones de cambio desde el último estado estable conocido, puede ser de utilidad el comando `git bisect`.

source: If you’re a small outfit or are just trying out Git in your organization and have only a few developers, things can be simple for you.
es: Si tienes un proyecto reducido o estás simplemente probando Git en tu empresa y sois unos pocos desarrolladores, el despliegue será sencillo.

source: Instead of reading from stdin, this script takes three arguments: the name of the reference (branch), the SHA-1 that reference pointed to before the push, and the SHA-1 the user is trying to push.
es: El lugar de recibir datos desde la entrada estandar (stdin), este script recibe tres argumentos: el nombre de la rama, la clave SHA-1 a la que esta apuntada antes del envio, y la clave SHA-1 que el usuario está intentando enviar.

source: It looks something like this:
es: Es algo parecido a esto:

source: The Git protocol is the fastest transfer protocol available.
es: El protocolo Git es el más rápido de todos los disponibles.

source: In centralized systems, every developer is a node working more or less equally on a central hub.
es: En los sistemas centralizados, cada desarrollador es un nodo de trabajo; trabajando todos ellos, en pie de igualdad, sobre un mismo repositorio central.

source: In Ruby, you can use the `FileUtils.mkdir_p()` function to create the subdirectory if it doesn’t exist.
es: En Ruby, puedes utilizar la función `FileUtils.mkdir_p()` para crear una carpeta.

source: Note that this is a lot different than the concept of HEAD in other VCSs you may be used to, such as Subversion or CVS.
es: Aunque es preciso comentar que este HEAD es totalmente distinto al concepto de HEAD en otros sistemas de control de cambios como Subversion o CVS.

source: Although it’s technically a text file, because it’s all ASCII, you don’t want to treat it as such because it’s really a lightweight database — you can’t merge the contents if two people changed it, and diffs generally aren’t helpful.
es: Aunque técnicamente es un archivo de texto, porque su contenido son caracteres ASCII. Realmente nunca lo tratarás como tal, porque en realidad es una base de datos ligera --y no puedes fusionar sus contenidos si dos personas lo cambian, porque las comparaciones no son de utilidad--.

source: When it’s determined that they’re totally stable, the topics are re-merged into `master` and are then rebuilt from the topics that were in `next` but didn’t yet graduate to `master`.
es: Y cuando las funcionalidades permanecen totalmente estables, se refusionan en la rama 'master'; componiendolas desde las funcionalidades en la rama 'next' aún sin promocionar a 'master'.

source: A Git clone gives you your own master branch and origin/master pointing to origin’s master branch.
es: Un clón Git te proporciona tu propia rama 'master' y otra rama 'origin/master' apuntando a la rama 'master' original.

source: Second, SSH is relatively easy to set up — SSH daemons are commonplace, many network admins have experience with them, and many OS distributions are set up with them or have tools to manage them.
es: En segundo lugar, SSH es sencillo de habilitar. Los demonios (daemons) SSH son de uso común, muchos administradores de red tienen experiencia con ellos y muchas distribuciones del SO los traen predefinidos o tienen herramientas para gestionarlos.

source: Insert 18333fig0327.png Figure 3-27.
es: Insert 18333fig0327.png Figura 3-27.

source: The `hooks` directory contains your client- or server-side hook scripts, which are discussed in detail in Chapter 6.
es: La carpeta 'hooks' contiene tus scripts, tanto de la parte cliente como de la parte servidor, tal y como se ha visto a detalle en el capítulo 6.

source: The Public Clone URL is a public, read-only Git URL over which anyone can clone the project.
es: El enlace "Public Clone URL", es un enlace público, de solo lectura; a través del cual cualquiera puede clonar el proyecto.

source: It takes a list of references that are being pushed from stdin; if it exits non-zero, none of them are accepted.
es: Recibe una lista de referencias que se están enviando (push) desde la entrada estandar (stdin); y, si termina con un codigo de salida distinto de cero, ninguna de ellas será aceptada.

source: Last, we’ll go over a few hosted options, if you don’t mind hosting your code on someone else’s server and don’t want to go through the hassle of setting up and maintaining your own server.
es: Por último, repasaremos algunas opciones albergadas on-line; por si no te preocupa guardar tu código en servidores de terceros y no deseas enredarte preparando y manteniendo tu propio servidor.

source: Unlike Centralized Version Control Systems (CVCSs), the distributed nature of Git allows you to be far more flexible in how developers collaborate on projects.
es: Al contrario de otros Sistemas Centralizados de Control de Versiones, (CVCSs, Centralized Version Control Systems), la naturaleza distribuida de Git permite mucha más flexibilidad en la manera de colaborar en proyectos.

source: If there is no output, then the patch should apply cleanly.
es: Si obtienes una salida vacia, el parche se podrá incorporar limpiamente.

source: The `*` next to each file means the file is selected to be staged.
es: El asterisco '*' al lado de cada archivo indica que dicho archivo ha sido seleccionado para ser preparado.

source: Then, you can see the previous commit by specifying `HEAD^`, which means "the parent of HEAD":
es: Se puede visualizar la anteúltima confirmación de cambios indicando 'HEAD^', que significa "el padre de HEAD":

source: To see what happens, you can manually ask Git to pack up the objects by calling the `git gc` command:
es: Puedes comprobar el proceso pidiendole expresamente a Git que empaquete objetos, utilizando el comando `git gc`:

source: The initial format in which Git saves objects on disk is called a loose object format.
es: El formato inicial como Git guarda sus objetos en disco es el formato conocido como "relajado" (loose).

source: If you stage one part of the file and leave another part unstaged, your status output will look like this:
es: Si se decide pasar solo una parte de un archivo y dejar sin pasar otra parte, la salida de estado mostrará algo así como:

source: Write out that tree (recording the state of the staging area or index to a tree object) and see what it looks like:
es: Escribiendo este árbol, (guardando el estado del área de preparación o índice), podrás ver que aparece algo así como:

source: `filter-branch` is the tool you probably want to use to scrub your entire history.
es: En estos casos, la mejor opción es utilizar la herramienta `filter-branch` para limpiar todo el historial.

source: Because it’s not as intelligent about transferring only the data you need — there is no dynamic work on the part of the server in these transactions — the HTTP protocol is often referred to as a _dumb_ protocol.
es: Y precisamente por esto, porque no es tan inteligente y no transfiere solamente los datos imprescindibles, (no hay un trabajo dinámico por parte del servidor), el protocolo HTTP suele ser conocido como el protocolo _estúpido_.

source: Now, you can sign tags without having to specify your key every time with the `git tag` command:
es: Puedes firmar etiquetas sin necesidad de indicar tu clave cada vez en el comando 'git tag'.

source: Each of these can be set to `true`, `false`, or `always`:
es: Cada uno de ellos puede fijarse a 'true' (verdadero), 'false' (falso) o 'always' (siempre):

source: You add the Rack project as a remote reference in your own project and then check it out into its own branch:
es: Se añade como una referencia remota en el propio proyecto, y luego se extrae (checkout) en su propia rama:

source: This is a subtle but incredibly annoying fact of cross-platform work.
es: Esta es una sutil, pero molesta, diferencia cuando se trabaja en entornos multi-plataforma.

source: This is because Windows uses both a carriage-return character and a linefeed character for newlines in its files, whereas Mac and Linux systems use only the linefeed character.
es: Esto se debe a que Windows utiliza retorno-de-carro y salto-de-linea para marcar los finales de línea de sus archivos. Mientras que Mac y Linux utilizan solamente el caracter de salto-de-linea.

source: ### The Smart Protocol ###
es: ### El protocolo inteligente (smart) ###

source: Clicking the "explain ssh keys" link takes you to detailed instructions on how to do so on all major operating systems.
es: El enlace "explicar claves ssh" ("explain ssh keys") te llevará a unas detalladas instrucciones de cómo generarlas en la mayor parte de los principales sistemas operativos.

source: ### Tree Objects ###
es: ### Objetos tipo arbol ###

source: A local repository is fast only if you have fast access to the data.
es: Un repositorio local es rápido solamente en aquellas ocasiones en que tienes un acceso rápido a él.

source: You can use these hooks for all sorts of reasons, and you’ll learn about a few of them here.
es: Estos puntos de enganche pueden utilizarse para multitud de aplicaciones. Vamos a ver unas pocas de ellas.

source: You can control which projects GitWeb lets users browse by adding or removing a `gitweb` setting in the Gitosis configuration file.
es: Los proyectos a ser mostrados por GitWeb se controlarán añadiendo o quitando parámetros 'gitweb' en el archivo de configuración de Gitosis.

source: That’s 1,200 times the number of grains of sand on the earth.
es: Es decir, unas 1.200 veces el número de granos de arena en la Tierra.

source: You have several options to get a remote Git repository up and running so that you can collaborate with others or share your work.
es: Tienes varias maneras de preparar un repositorio remoto Git, de colaborar con otras personas o de compartir tu trabajo.

source: #### Uploading Data ####
es: #### Enviando datos, (Uploading) ####

source: The other advantage of this approach is that you get the history of the commits as well.
es: Otra ventaja de esta forma de trabajar es que recibes también el histórico de confirmaciones de cambio (commits).

source: Pasting the text often causes formatting issues, especially with "smarter" clients that don’t preserve newlines and other whitespace appropriately.
es: Pegar el texto directamente suele causar problemas de formato. Especialmente con los clientes de correo más "inteligentes", que no preservan adecuadamente los saltos de línea y otros espaciados.

source: You can take the changes on client that aren’t on server (C8 and C9) and replay them on your master branch by using the `--onto` option of `git rebase`:
es: Puedes coger los cambios del cliente que no estan en server (C8 y C9), y reaplicarlos sobre tu rama principal usando la opción '--onto' del comando 'git rebase':

source: Stashing takes the dirty state of your working directory — that is, your modified tracked files and staged changes — and saves it on a stack of unfinished changes that you can reapply at any time.
es: Este comando de guardado rápido (stashing) toma el estado del espacio de trabajo, con todas las modificaciones en los archivos bajo control de cambios, y lo guarda en una pila provisional. Desde allí, se podrán recuperar posteriormente y volverlas a aplicar de nuevo sobre el espacio de trabajo.

source: In Git, this is a pointer to the local branch you’re currently on.
es: En Git, es simplemente el apuntador a la rama local en la que tú estés en ese momento.

source: Now, Jessica pushes her work up to the server:
es: Tras esto, Jessica envia (push) su trabajo al servidor:

source: I’ll cover most of the major hook filenames here.
es: Vamos a ver la mayoría de nombres de puntos de enganche disponibles.

source: Then, you specify the mode, SHA-1, and filename:
es: Para terminar, has de indicar el modo, la clave SHA-1 y el nombre de archivo:

source: Git compresses the new content with zlib, which you can do in Ruby with the zlib library.
es: Git comprime todo el contenido con zlib. Y tu puedes hacer lo mismo en Ruby con la libreria zlib.

source: In this section, you’ll learn about a few common patterns for contributing to a project.
es: En esta sección, aprenderás acerca de las formas más habituales de contribuir a un proyecto.

source: Now John can clone the project and get updates, but Gitosis won’t allow him to push back up to the project.
es: Habilitandole así para clonar y recibir actualizaciónes desde el servidor; pero impidiendole enviar de vuelta cambios al proyecto.

source: When you clone a repository, it generally automatically creates a `master` branch that tracks `origin/master`.
es: Cuando clonas un repositorio, este suele crear automáticamente una rama 'master' que hace seguimiento de 'origin/master'.
